TMRh20/AutoAnalogAudio/src/NRF52840/AutoAnalogAudio.cpp
/*
AutoAnalogAudio streaming via DAC & ADC by TMRh20
Copyright (C) 2016  TMRh20 - tmrh20@gmail.com, github.com/TMRh20

This program is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

/****************************************************************************/

#if defined(ARDUINO_ARCH_NRF52840) || defined(ARDUINO_ARCH_NRF52)

    #include "../AutoAnalogAudio.h"
    #include <hal/nrf_pdm.h>
    #include <hal/nrf_i2s.h>

    #if !defined __MBED__
        #define myPDM NRF_PDM0
uint16_t AutoAnalog::adcBuffer16[MAX_BUFFER_SIZE];
bool AutoAnalog::adcReady;
uint32_t AutoAnalog::aSize;
uint8_t AutoAnalog::aCtr;
uint16_t* AutoAnalog::adcBuf0;
uint16_t* AutoAnalog::adcBuf1;
void (*AutoAnalog::_onReceive)(uint16_t* buf, uint32_t buf_len);
    #endif

    #define PDM_IRQ_PRIORITY 7
    #ifndef NRF_PDM_FREQ_1280K
        #define NRF_PDM_FREQ_1280K (nrf_pdm_freq_t)(0x0A000000UL) ///< PDM_CLK= 1.280 MHz (32 MHz / 25) => Fs= 20000 Hz
    #endif
    #ifndef NRF_PDM_FREQ_2667K
        #define NRF_PDM_FREQ_2667K (nrf_pdm_freq_t)(0x15000000UL)
    #endif
    #ifndef NRF_PDM_FREQ_2000K
        #define NRF_PDM_FREQ_2000K (nrf_pdm_freq_t)(0x10000000UL)
    #endif

/******************* USER DEFINES - Configure pins etc here *****************/
    #define DEFAULT_PDM_GAIN 40

    /* I2s default config  MAX98357A Breakout also needs SD pin set HIGH
    I2S_PIN_MCK    2   // Not used with MAX98357A
    I2S_PORT_MCK   0
    I2S_PIN_SCK    3   // BCLK
    I2S_PORT_SCK   0
    I2S_PIN_LRCK   29  // LRCK
    I2S_PORT_LRCK  0
    I2S_PIN_SDOUT  5   // GPIO Pin numbers
    I2S_PORT_SDOUT 0
    */

    /* PWM Config */
    #define DEFAULT_PWM_PIN  5 // GPIO Pin number
    #define DEFAULT_PWM_PORT 0 // On XIAO port 0 is for pins 1-5 port 1 is for all higher pins
//#define DEFAULT_PWM_PIN2 4  //Enable a second output pin
//#define DEFAULT_PWM_PORT2 0

    #ifndef PIN_PDM_DIN // Arduino pin numbers
        #define PIN_PDM_DIN 35
        #define PIN_PDM_CLK 36
        #define PIN_PDM_PWR -1
    #endif

/****************************************************************************/
/* Public Functions */
/****************************************************************************/

uint8_t analogCounter = 0;
uint16_t mycounter = 0;
// int16_t sine_table[] = { 0, 0, 23170, 23170, 32767, 32767, 23170, 23170, 0, 0, -23170, -23170, -32768, -32768, -23170, -23170};

AutoAnalog::AutoAnalog()
{

    adcReady = true;
    adcBitsPerSample = 8;
    pwrPin = PIN_PDM_PWR;
    dinPin = PIN_PDM_DIN;
    clkPin = PIN_PDM_CLK;
    gain = -1;

    dacBitsPerSample = 8;
    autoAdjust = true;
    for (int i = 0; i < MAX_BUFFER_SIZE; i++) {
        dacBuffer[i] = 0;
    }

    aSize = MAX_BUFFER_SIZE;
    aCtr = 0;
    sampleCounter = 0;
    maxBufferSize = 0;
    I2S_PIN_MCK = 2;
    I2S_PORT_MCK = 0;
    I2S_PIN_SCK = 3;
    I2S_PORT_SCK = 0;
    I2S_PIN_LRCK = 29;
    I2S_PORT_LRCK = 0;
    I2S_PIN_SDOUT = 5;
    I2S_PORT_SDOUT = 0;
    I2S_PIN_SDIN = 4;
    I2S_PORT_SDIN = 0;
}

void AutoAnalog::begin(uint8_t enADC, uint8_t enDAC, uint8_t _useI2S)
{

    maxBufferSize = maxBufferSize > 0 ? maxBufferSize : MAX_BUFFER_SIZE;

    // Fix for backward compatiblity with badly thought out changes
    if (_useI2S == 1) {
        enDAC = 2;
    }
    else if (_useI2S == 2) {
        enADC = 2;
    }
    else if (_useI2S == 3) {
        enADC = 2;
        enDAC = 2;
    }
    else if (_useI2S == 4 || _useI2S == 5) {
        enADC = 3;
    }
    else if (_useI2S == 6) {
        enADC = 3;
        enDAC = 2;
    }

    enableADC = enADC;
    enableDAC = enDAC;

    if (enADC) {
        adcBuf0 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
        memset(adcBuf0, 0, maxBufferSize * 2);
        adcBuf1 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
        memset(adcBuf1, 0, maxBufferSize * 2);
        adcSetup();
    }

    if (enDAC) {
        dacBuf0 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
        memset(dacBuf0, 0, maxBufferSize * 2);
        dacBuf1 = reinterpret_cast<uint16_t*>(malloc(maxBufferSize * 2));
        memset(dacBuf1, 0, maxBufferSize * 2);
        dacSetup();
    }
}

/****************************************************************************/

void AutoAnalog::setSampleRate(uint32_t sampRate, bool stereo)
{

    if (enableDAC == 1) {
        NRF_PWM0->TASKS_STOP = 1;
        uint32_t timer = millis();
        while (NRF_PWM0->EVENTS_STOPPED == 0) {
            if (millis() - timer > 1000) {
                break;
            }
        }

        NRF_PWM0->COUNTERTOP = (((uint16_t)((16000000 / sampRate))) << PWM_COUNTERTOP_COUNTERTOP_Pos);
        NRF_PWM0->TASKS_SEQSTART[0] = 1;
    }

    if (enableDAC == 2 || enableADC == 2) {

        if (stereo) {
            NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_STEREO << I2S_CONFIG_CHANNELS_CHANNELS_Pos;
        }
        else {
            NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_LEFT << I2S_CONFIG_CHANNELS_CHANNELS_Pos;
        }

        if (sampRate <= 16000) {
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        }
        else if (sampRate <= 22500) {
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV15 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        }
        else if (sampRate <= 24000) {
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV11 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        }
        else if (sampRate <= 32000) {
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_64X << I2S_CONFIG_RATIO_RATIO_Pos;
        }
        else if (sampRate <= 45000) {
            NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV23 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
            NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_32X << I2S_CONFIG_RATIO_RATIO_Pos;
        }
    }

    if (enableADC == 1) {
        if (sampRate <= 16000) {
            // Set default 16khz sample rate
            NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio80 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);
    #if defined __MBED__
            nrf_pdm_clock_set(NRF_PDM_FREQ_1280K);
    #else
            nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_1280K);
    #endif
        }
        else if (sampRate <= 22500) {
            NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio64 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);
    #if defined __MBED__
            nrf_pdm_clock_set(NRF_PDM_FREQ_1280K);
    #else
            nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_1280K);
    #endif
        }
        else if (sampRate <= 24000) {
            NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio80 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);
    #if defined __MBED__
            nrf_pdm_clock_set(NRF_PDM_FREQ_2000K);
    #else
            nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_2000K);
    #endif
        }
        else if (sampRate <= 32000) {
            NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio64 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);
    #if defined __MBED__
            nrf_pdm_clock_set(NRF_PDM_FREQ_2000K); // 2667 / 64 = 33.337khz, /80 = 41.667
    #else
            nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_2000K); // 2667 / 64 = 33.337khz, /80 = 41.667
    #endif
        }
        else if (sampRate <= 45000) { // 41.67khz
            NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio64 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);
    #if defined __MBED__
            nrf_pdm_clock_set(NRF_PDM_FREQ_2667K);
    #else
            nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_2667K); // 2667 / 64 = 33.337khz, /80 = 41.667
    #endif
        }
    }

