TMRh20/AutoAnalogAudio/src/NRF52840/AutoAnalogAudio.cpp
    if (enableADC == 3) {
        NRF_SAADC->SAMPLERATE = 16000000 / sampRate / 2 | SAADC_SAMPLERATE_MODE_Timers << SAADC_SAMPLERATE_MODE_Pos;
    }
}

/****************************************************************************/

void AutoAnalog::triggerADC()
{
}

/****************************************************************************/

void AutoAnalog::enableAdcChannel(uint8_t pinAx)
{
    #if defined __MBED__
    nrf_pdm_enable();
    #else
    nrf_pdm_enable(myPDM);
    #endif
}

/****************************************************************************/

void AutoAnalog::disableAdcChannel(uint8_t pinAx)
{
    #if defined __MBED__
    nrf_pdm_disable();
    #else
    nrf_pdm_disable(myPDM);
    #endif
}

/****************************************************************************/

void AutoAnalog::getADC(uint32_t samples)
{

    if (enableADC == 2) {

        bool started = false;
        if (NRF_I2S->ENABLE == 0) {
            NRF_I2S->ENABLE = 1;
            started = true;
        }
        else {
            while (NRF_I2S->EVENTS_RXPTRUPD == 0) {
            }
        }

        if (adcWhichBuf == 0) {
            NRF_I2S->RXD.PTR = (uint32_t)&adcBuf0[0];
        }
        else {
            NRF_I2S->RXD.PTR = (uint32_t)&adcBuf1[0];
        }
        uint8_t divider = 2;
        if (adcBitsPerSample == 24) {
            divider = 1;
        }
        else if (adcBitsPerSample == 8) {
            divider = 4;
        }

        if (enableDAC != 2) { // Only update MAXCNT if I2S output is disabled
            NRF_I2S->RXTXD.MAXCNT = samples / divider;
        }

        NRF_I2S->EVENTS_RXPTRUPD = 0;

        if (adcBitsPerSample == 24) {
            if (NRF_I2S->CONFIG.SWIDTH != I2S_CONFIG_SWIDTH_SWIDTH_24BIT << I2S_CONFIG_SWIDTH_SWIDTH_Pos) {
                NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_24BIT << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
            }
            if (adcWhichBuf == 0) {
                memcpy(adcBuffer16, adcBuf0, samples * 4);
            }
            else {
                memcpy(adcBuffer16, adcBuf1, samples * 4);
            }
        }
        else if (adcBitsPerSample == 16) {
            if (adcWhichBuf == 0) {
                memcpy(adcBuffer16, adcBuf0, samples * 2);
            }
            else {
                memcpy(adcBuffer16, adcBuf1, samples * 2);
            }
        }
        else if (adcBitsPerSample == 8) {
            if (adcWhichBuf == 0) {
                memcpy(adcBuffer, adcBuf0, samples);
            }
            else {
                memcpy(adcBuffer, adcBuf1, samples);
            }
        }

        adcWhichBuf = !adcWhichBuf;
        if (started) {
            NRF_I2S->TASKS_START = 1;
        }
    }
    else if (enableADC == 1) {
        while (!adcReady) {
            __WFE();
        };
        aSize = samples;
        adcReady = false;
    }
    else if (enableADC == 3) {

        while (NRF_SAADC->EVENTS_END == 0) {
        }

        if (!adcWhichBuf) {
            NRF_SAADC->RESULT.PTR = (uint32_t)adcBuf1;
        }
        else {
            NRF_SAADC->RESULT.PTR = (uint32_t)adcBuf0;
        }
        NRF_SAADC->RESULT.MAXCNT = samples;
        NRF_SAADC->EVENTS_END = 0;
        NRF_SAADC->TASKS_START = 1;

        if (adcBitsPerSample == 16) {
            if (!adcWhichBuf) {
                for (uint32_t i = 0; i < samples; i++) {
                    adcBuffer16[i] = adcBuf0[i] << 2;
                }
            }
            else {
                for (uint32_t i = 0; i < samples; i++) {
                    adcBuffer16[i] = adcBuf1[i] << 2;
                }
            }
        }
        else if (adcBitsPerSample == 8) {
            if (!adcWhichBuf) {
                for (uint32_t i = 0; i < samples; i++) {
                    adcBuffer[i] = adcBuf0[i] >> 6;
                }
            }
            else {
                for (uint32_t i = 0; i < samples; i++) {
                    adcBuffer[i] = adcBuf1[i] >> 6;
                }
            }
        }
        adcWhichBuf = !adcWhichBuf;
    }
}

/****************************************************************************/

void AutoAnalog::feedDAC(uint8_t dacChannel, uint32_t samples, bool startInterrupts)
{

    if (enableDAC == 2) {

        bool started = false;
        if (NRF_I2S->ENABLE == 0) {
            NRF_I2S->ENABLE = 1;
            started = true;
        }
        else {
            while (NRF_I2S->EVENTS_TXPTRUPD == 0) {
            }
        }

        if (dacBitsPerSample == 8) {
            if (whichBuf) {
                for (uint32_t i = 0; i < samples; i++) {
                    dacBuf0[i] = dacBuffer[i] << 7;
                }
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf0[0];
            }
            else {
                for (uint32_t i = 0; i < samples; i++) {
                    dacBuf1[i] = dacBuffer[i] << 7;
                }
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf1[0];
            }
        }
        else if (dacBitsPerSample == 16) {
            if (whichBuf) {
                memcpy(dacBuf0, dacBuffer16, samples * 2);
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf0[0];
            }
            else {
                memcpy(dacBuf1, dacBuffer16, samples * 2);
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf1[0];
            }
        }
        else if (dacBitsPerSample == 24) {
            if (NRF_I2S->CONFIG.SWIDTH != I2S_CONFIG_SWIDTH_SWIDTH_24BIT << I2S_CONFIG_SWIDTH_SWIDTH_Pos) {
                NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_24BIT << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
            }
            if (whichBuf) {
                memcpy(dacBuf0, dacBuffer16, samples * 4);
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf0[0];
            }
            else {
                memcpy(dacBuf1, dacBuffer16, samples * 4);
                NRF_I2S->TXD.PTR = (uint32_t)&dacBuf1[0];
            }
        }

        whichBuf = !whichBuf;

        uint8_t divider = 2;
        if (dacBitsPerSample == 16) {
            divider = 2;
        }
        else if (dacBitsPerSample == 24) {
            divider = 1;
        }

        NRF_I2S->RXTXD.MAXCNT = samples / divider;
        NRF_I2S->EVENTS_TXPTRUPD = 0;

        if (started) {
            NRF_I2S->TASKS_START = 1;
        }
    }
    else if (enableDAC == 1) {
        uint32_t timer = millis() + 1000;
        while (NRF_PWM0->EVENTS_SEQEND[0] == 0) {
            if (millis() > timer) {
                NRF_PWM0->TASKS_SEQSTART[0] = 1;
                return;
            }
        }
        NRF_PWM0->EVENTS_SEQEND[0] = 0;

        if (dacBitsPerSample > 8) {
            if (whichBuf) {
                memcpy(dacBuf0, dacBuffer16, samples * 2);
            }
            else {
                memcpy(dacBuf1, dacBuffer16, samples * 2);
            }
        }
        else {
            if (whichBuf) {
                for (uint32_t i = 0; i < samples; i++) {
                    dacBuf0[i] = (uint16_t)(dacBuffer[i] << 1);
                }
            }
            else {
                for (uint32_t i = 0; i < samples; i++) {
                    dacBuf1[i] = (uint16_t)(dacBuffer[i] << 1);
                }
            }
        }
        if (whichBuf) {
            NRF_PWM0->SEQ[0].PTR = ((uint32_t)(&dacBuf0[0]) << PWM_SEQ_PTR_PTR_Pos);
        }
        else {
            NRF_PWM0->SEQ[0].PTR = ((uint32_t)(&dacBuf1[0]) << PWM_SEQ_PTR_PTR_Pos);
        }
        whichBuf = !whichBuf;

        NRF_PWM0->SEQ[0].CNT = (samples << PWM_SEQ_CNT_CNT_Pos);
        NRF_PWM0->TASKS_SEQSTART[0] = 1;
    }
}

