TMRh20/AutoAnalogAudio/src/NRF52840/AutoAnalogAudio.cpp
/****************************************************************************/
/* Private Functions */
/****************************************************************************/

void AutoAnalog::dacBufferStereo(uint8_t dacChannel)
{
}

/****************************************************************************/

uint32_t AutoAnalog::frequencyToTimerCount(uint32_t frequency)
{

    return 1;
}

/****************************************************************************/

void AutoAnalog::adcSetup(void)
{

    if (enableADC == 2) {

        NRF_I2S->CONFIG.RXEN = (I2S_CONFIG_RXEN_RXEN_ENABLE << I2S_CONFIG_RXEN_RXEN_Pos);

        // Enable MCK generator
        NRF_I2S->CONFIG.MCKEN = (I2S_CONFIG_MCKEN_MCKEN_ENABLE << I2S_CONFIG_MCKEN_MCKEN_Pos);

        // Master mode, 16Bit, left aligned
        NRF_I2S->CONFIG.MODE = I2S_CONFIG_MODE_MODE_MASTER << I2S_CONFIG_MODE_MODE_Pos;

        NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_16BIT << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
        NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
        NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        NRF_I2S->CONFIG.ALIGN = I2S_CONFIG_ALIGN_ALIGN_LEFT << I2S_CONFIG_ALIGN_ALIGN_Pos;

        // Format = I2S
        NRF_I2S->CONFIG.FORMAT = I2S_CONFIG_FORMAT_FORMAT_I2S << I2S_CONFIG_FORMAT_FORMAT_Pos;

        // Use stereo
        NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_LEFT << I2S_CONFIG_CHANNELS_CHANNELS_Pos;

        // Configure pins
        NRF_I2S->PSEL.MCK = (I2S_PIN_MCK << I2S_PSEL_MCK_PIN_Pos) | (I2S_PSEL_MCK_CONNECT_Connected << I2S_PSEL_MCK_CONNECT_Pos) | (I2S_PORT_MCK << I2S_PSEL_MCK_PORT_Pos);
        NRF_I2S->PSEL.SCK = (I2S_PIN_SCK << I2S_PSEL_SCK_PIN_Pos) | (I2S_PSEL_SCK_CONNECT_Connected << I2S_PSEL_SCK_CONNECT_Pos) | (I2S_PORT_SCK << I2S_PSEL_SCK_PORT_Pos);
        NRF_I2S->PSEL.LRCK = (I2S_PIN_LRCK << I2S_PSEL_LRCK_PIN_Pos) | (I2S_PSEL_LRCK_CONNECT_Connected << I2S_PSEL_LRCK_CONNECT_Pos) | (I2S_PORT_LRCK << I2S_PSEL_LRCK_PORT_Pos);
        NRF_I2S->PSEL.SDIN = (I2S_PIN_SDIN << I2S_PSEL_SDIN_PIN_Pos) | (I2S_PSEL_SDIN_CONNECT_Connected << I2S_PSEL_SDIN_CONNECT_Pos) | (I2S_PORT_SDIN << I2S_PSEL_SDIN_PORT_Pos);

        // Configure data pointer
        NRF_I2S->RXD.PTR = (uint32_t)adcBuf0;
        NRF_I2S->RXTXD.MAXCNT = 16; // / sizeof(uint32_t);
    }
    else if (enableADC == 1) {

        set_callback(adcCallback);

        // Enable high frequency oscillator if not already enabled
        if (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {
            NRF_CLOCK->TASKS_HFCLKSTART = 1;
            while (NRF_CLOCK->EVENTS_HFCLKSTARTED == 0) {
            }
        }

        // Set default 16khz sample rate
        NRF_PDM->RATIO = ((PDM_RATIO_RATIO_Ratio80 << PDM_RATIO_RATIO_Pos) & PDM_RATIO_RATIO_Msk);

    #if defined __MBED__

        nrf_pdm_clock_set(NRF_PDM_FREQ_1280K);
        // Set default channel mono
        nrf_pdm_mode_set(NRF_PDM_MODE_MONO, NRF_PDM_EDGE_LEFTFALLING);
        if (gain == -1) {
            gain = DEFAULT_PDM_GAIN;
        }
        nrf_pdm_gain_set(gain, gain);

        pinMode(clkPin, OUTPUT);
        digitalWrite(clkPin, LOW);

        pinMode(dinPin, INPUT);

        nrf_pdm_psel_connect(digitalPinToPinName(clkPin), digitalPinToPinName(dinPin));

        // Enable PDM interrupts and clear events
        nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
        nrf_pdm_event_clear(NRF_PDM_EVENT_END);
        nrf_pdm_event_clear(NRF_PDM_EVENT_STOPPED);
        nrf_pdm_int_enable(NRF_PDM_INT_STARTED | NRF_PDM_INT_STOPPED);

        // Turn on the mic
        if (pwrPin > -1) {
            pinMode(pwrPin, OUTPUT);
            digitalWrite(pwrPin, HIGH);
        }
        else {
        }

        // set the PDM IRQ priority and enable
        NVIC_SetPriority(PDM_IRQn, PDM_IRQ_PRIORITY);
        NVIC_ClearPendingIRQ(PDM_IRQn);
        NVIC_EnableIRQ(PDM_IRQn);

        // enable and trigger start task
        nrf_pdm_enable();
        nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);
        nrf_pdm_task_trigger(NRF_PDM_TASK_START);

    #else // MBED / Non-Mbed

        nrf_pdm_clock_set(myPDM, NRF_PDM_FREQ_1280K);

        // Set default channel mono
        nrf_pdm_mode_set(myPDM, NRF_PDM_MODE_MONO, NRF_PDM_EDGE_LEFTFALLING);
        if (gain == -1) {
            gain = DEFAULT_PDM_GAIN;
        }
        nrf_pdm_gain_set(myPDM, gain, gain);

        pinMode(clkPin, OUTPUT);
        digitalWrite(clkPin, LOW);

        pinMode(dinPin, INPUT);

        nrf_pdm_psel_connect(myPDM, digitalPinToPinName(clkPin), digitalPinToPinName(dinPin));

        // Enable PDM interrupts and clear events
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STARTED);
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_END);
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STOPPED);
        nrf_pdm_int_enable(myPDM, NRF_PDM_INT_STARTED | NRF_PDM_INT_STOPPED);

        // Turn on the mic
        if (pwrPin > -1) {
            pinMode(pwrPin, OUTPUT);
            digitalWrite(pwrPin, HIGH);
        }
        else {
        }

        // set the PDM IRQ priority and enable
        NVIC_SetPriority(PDM_IRQn, PDM_IRQ_PRIORITY);
        NVIC_ClearPendingIRQ(PDM_IRQn);
        NVIC_EnableIRQ(PDM_IRQn);

        // enable and trigger start task
        nrf_pdm_enable(myPDM);
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STARTED);
        nrf_pdm_task_trigger(myPDM, NRF_PDM_TASK_START);

    #endif
    }
    else if (enableADC == 3) {

        NRF_SAADC->CH[0].PSELP = dinPin << SAADC_CH_PSELP_PSELP_Pos;
        NRF_SAADC->CH[0].PSELN = dinPin << SAADC_CH_PSELN_PSELN_Pos;
        NRF_SAADC->CH[0].CONFIG = (SAADC_CH_CONFIG_RESP_VDD1_2 << SAADC_CH_CONFIG_RESP_Pos) | SAADC_CH_CONFIG_GAIN_Gain4 << SAADC_CH_CONFIG_GAIN_Pos | SAADC_CH_CONFIG_REFSEL_Internal << SAADC_CH_CONFIG_REFSEL_Pos | SAADC_CH_CONFIG_TACQ_5us << SAADC_CH_CONFIG_TACQ_Pos | SAADC_CH_CONFIG_MODE_Diff << SAADC_CH_CONFIG_MODE_Pos | SAADC_CH_CONFIG_BURST_Disabled << SAADC_CH_CONFIG_BURST_Pos;
        NRF_SAADC->RESOLUTION = SAADC_RESOLUTION_VAL_14bit << SAADC_RESOLUTION_VAL_Pos;
        NRF_SAADC->OVERSAMPLE = SAADC_OVERSAMPLE_OVERSAMPLE_Over2x << SAADC_OVERSAMPLE_OVERSAMPLE_Pos;
        NRF_SAADC->SAMPLERATE = 16000000 / 16000 / 2 | SAADC_SAMPLERATE_MODE_Timers << SAADC_SAMPLERATE_MODE_Pos;
        NRF_SAADC->RESULT.PTR = (uint32_t)adcBuf0;
        NRF_SAADC->RESULT.MAXCNT = 16;
        NRF_SAADC->ENABLE = true;

        NRF_SAADC->TASKS_CALIBRATEOFFSET = true;
        while (!NRF_SAADC->EVENTS_CALIBRATEDONE) {
        }

        NRF_SAADC->EVENTS_STARTED = 0;
        NRF_SAADC->TASKS_START = 1;
        while (!NRF_SAADC->EVENTS_STARTED) {
        };
        while (NRF_SAADC->STATUS == (SAADC_STATUS_STATUS_Busy << SAADC_STATUS_STATUS_Pos))
            ;
        NRF_SAADC->TASKS_SAMPLE = 1;

    } // USE_I2S
}

