TMRh20/AutoAnalogAudio/src/NRF52840/AutoAnalogAudio.cpp
/****************************************************************************/

void AutoAnalog::adcInterrupts(bool enabled)
{
}

/****************************************************************************/

void AutoAnalog::dacSetup(void)
{

    if (enableDAC == 2) {
        // Enable transmission
        NRF_I2S->CONFIG.TXEN = (I2S_CONFIG_TXEN_TXEN_ENABLE << I2S_CONFIG_TXEN_TXEN_Pos);

        // Enable MCK generator
        NRF_I2S->CONFIG.MCKEN = (I2S_CONFIG_MCKEN_MCKEN_ENABLE << I2S_CONFIG_MCKEN_MCKEN_Pos);

        // Master mode, 16Bit, left aligned
        NRF_I2S->CONFIG.MODE = I2S_CONFIG_MODE_MODE_MASTER << I2S_CONFIG_MODE_MODE_Pos;

        NRF_I2S->CONFIG.SWIDTH = I2S_CONFIG_SWIDTH_SWIDTH_16BIT << I2S_CONFIG_SWIDTH_SWIDTH_Pos;
        NRF_I2S->CONFIG.MCKFREQ = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos;
        NRF_I2S->CONFIG.RATIO = I2S_CONFIG_RATIO_RATIO_128X << I2S_CONFIG_RATIO_RATIO_Pos;
        NRF_I2S->CONFIG.ALIGN = I2S_CONFIG_ALIGN_ALIGN_LEFT << I2S_CONFIG_ALIGN_ALIGN_Pos;

        // Format = I2S
        NRF_I2S->CONFIG.FORMAT = I2S_CONFIG_FORMAT_FORMAT_I2S << I2S_CONFIG_FORMAT_FORMAT_Pos;

        // Use stereo
        NRF_I2S->CONFIG.CHANNELS = I2S_CONFIG_CHANNELS_CHANNELS_LEFT << I2S_CONFIG_CHANNELS_CHANNELS_Pos;

        // Configure pins
        NRF_I2S->PSEL.MCK = (I2S_PIN_MCK << I2S_PSEL_MCK_PIN_Pos) | (I2S_PSEL_MCK_CONNECT_Connected << I2S_PSEL_MCK_CONNECT_Pos) | (I2S_PORT_MCK << I2S_PSEL_MCK_PORT_Pos);
        NRF_I2S->PSEL.SCK = (I2S_PIN_SCK << I2S_PSEL_SCK_PIN_Pos) | (I2S_PSEL_SCK_CONNECT_Connected << I2S_PSEL_SCK_CONNECT_Pos) | (I2S_PORT_SCK << I2S_PSEL_SCK_PORT_Pos);
        NRF_I2S->PSEL.LRCK = (I2S_PIN_LRCK << I2S_PSEL_LRCK_PIN_Pos) | (I2S_PSEL_LRCK_CONNECT_Connected << I2S_PSEL_LRCK_CONNECT_Pos) | (I2S_PORT_LRCK << I2S_PSEL_LRCK_PORT_Pos);
        NRF_I2S->PSEL.SDOUT = (I2S_PIN_SDOUT << I2S_PSEL_SDOUT_PIN_Pos) | (I2S_PSEL_SDOUT_CONNECT_Connected << I2S_PSEL_SDOUT_CONNECT_Pos) | (I2S_PORT_SDOUT << I2S_PSEL_SDOUT_PORT_Pos);

        // NRF_I2S->INTENSET = I2S_INTEN_TXPTRUPD_Enabled << I2S_INTEN_TXPTRUPD_Pos;
        // NVIC_EnableIRQ(I2S_IRQn);

        // Configure data pointer
        NRF_I2S->TXD.PTR = (uint32_t)&dacBuf0[0];
        NRF_I2S->RXD.PTR = (uint32_t)dacBuf1;
        NRF_I2S->RXTXD.MAXCNT = 16; // / sizeof(uint32_t);
    }
    else if (enableDAC == 1) {

        NRF_PWM0->PSEL.OUT[0] = (DEFAULT_PWM_PIN << PWM_PSEL_OUT_PIN_Pos) | (PWM_PSEL_OUT_CONNECT_Connected << PWM_PSEL_OUT_CONNECT_Pos | DEFAULT_PWM_PORT << PWM_PSEL_OUT_PORT_Pos);
    #if defined DEFAULT_PWM_PIN2
        NRF_PWM0->PSEL.OUT[1] = (DEFAULT_PWM_PIN2 << PWM_PSEL_OUT_PIN_Pos) | (PWM_PSEL_OUT_CONNECT_Connected << PWM_PSEL_OUT_CONNECT_Pos | DEFAULT_PWM_PORT2 << PWM_PSEL_OUT_PORT_Pos);
    #endif
        NRF_PWM0->ENABLE = (PWM_ENABLE_ENABLE_Enabled << PWM_ENABLE_ENABLE_Pos);
        NRF_PWM0->MODE = (PWM_MODE_UPDOWN_Up << PWM_MODE_UPDOWN_Pos);
        NRF_PWM0->PRESCALER = (PWM_PRESCALER_PRESCALER_DIV_1 << PWM_PRESCALER_PRESCALER_Pos);
        NRF_PWM0->COUNTERTOP = (((uint16_t)((16000000 / DEFAULT_FREQUENCY))) << PWM_COUNTERTOP_COUNTERTOP_Pos); // 1 msec
        NRF_PWM0->LOOP = (0 << PWM_LOOP_CNT_Pos);
        NRF_PWM0->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
        NRF_PWM0->SEQ[0].PTR = ((uint32_t)(&dacBuf0[0]) << PWM_SEQ_PTR_PTR_Pos);
        NRF_PWM0->SEQ[0].CNT = 1 << PWM_SEQ_CNT_CNT_Pos; //((sizeof(dacBuf0) / sizeof(uint16_t)) << PWM_SEQ_CNT_CNT_Pos);
        NRF_PWM0->SEQ[0].REFRESH = 0;
        NRF_PWM0->SEQ[0].ENDDELAY = 0;

        // NRF_PWM0->INTENSET = PWM_INTENSET_SEQEND0_Enabled << PWM_INTENSET_SEQEND0_Pos;
        // NVIC_EnableIRQ(PWM0_IRQn);
        NRF_PWM0->TASKS_SEQSTART[0] = 1;
    }
}

/****************************************************************************/

void AutoAnalog::disableDAC(bool withinTask)
{
    if (enableDAC == 2) {
        NRF_I2S->TASKS_STOP = 1;
        NRF_I2S->ENABLE = 0;
    }
    else if (enableDAC == 1) {
        NRF_PWM0->TASKS_STOP = 1;
    }
}

/****************************************************************************/

void AutoAnalog::dacHandler(void)
{
}

/****************************************************************************/

void AutoAnalog::tcSetup(uint32_t sampRate)
{
}

/****************************************************************************/

void AutoAnalog::tc2Setup(uint32_t sampRate)
{
}
extern "C" {
__attribute__((__used__)) void I2S_IRQHandler_v(void)
{
}
}

    /****************************************************************************/
    #if defined __MBED__
extern "C" {
__attribute__((__used__)) void PDM_IRQHandler_v(void)
{
    if (nrf_pdm_event_check(NRF_PDM_EVENT_STARTED)) {
        nrf_pdm_event_clear(NRF_PDM_EVENT_STARTED);

        // switch to fill

        if (AutoAnalog::aCtr) {
            nrf_pdm_buffer_set((uint32_t*)(AutoAnalog::adcBuf0), AutoAnalog::aSize);
            if (AutoAnalog::_onReceive) {
                NVIC_DisableIRQ(PDM_IRQn);
                AutoAnalog::_onReceive(AutoAnalog::adcBuf1, AutoAnalog::aSize);
                NVIC_EnableIRQ(PDM_IRQn);
            }
        }
        else {
            nrf_pdm_buffer_set((uint32_t*)(AutoAnalog::adcBuf1), AutoAnalog::aSize);
            if (AutoAnalog::_onReceive) {
                NVIC_DisableIRQ(PDM_IRQn);
                AutoAnalog::_onReceive(AutoAnalog::adcBuf0, AutoAnalog::aSize);
                NVIC_EnableIRQ(PDM_IRQn);
            }
        }

        // Flip to next buffer
        AutoAnalog::aCtr = (AutoAnalog::aCtr + 1) % 2;
    }
    else if (nrf_pdm_event_check(NRF_PDM_EVENT_STOPPED)) {
        nrf_pdm_event_clear(NRF_PDM_EVENT_STOPPED);
    }
    else if (nrf_pdm_event_check(NRF_PDM_EVENT_END)) {
        nrf_pdm_event_clear(NRF_PDM_EVENT_END);
    }
}
}

    #elif !defined MBED

extern "C" {
__attribute__((__used__)) void PDM_IRQHandler(void)
{
    if (nrf_pdm_event_check(myPDM, NRF_PDM_EVENT_STARTED)) {
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STARTED);

        // switch to fill

        if (AutoAnalog::aCtr) {
            nrf_pdm_buffer_set(myPDM, (uint32_t*)(AutoAnalog::adcBuf0), AutoAnalog::aSize);
            if (AutoAnalog::_onReceive) {
                NVIC_DisableIRQ(PDM_IRQn);
                AutoAnalog::_onReceive(AutoAnalog::adcBuf1, AutoAnalog::aSize);
                NVIC_EnableIRQ(PDM_IRQn);
            }
        }
        else {
            nrf_pdm_buffer_set(myPDM, (uint32_t*)(AutoAnalog::adcBuf1), AutoAnalog::aSize);
            if (AutoAnalog::_onReceive) {
                NVIC_DisableIRQ(PDM_IRQn);
                AutoAnalog::_onReceive(AutoAnalog::adcBuf0, AutoAnalog::aSize);
                NVIC_EnableIRQ(PDM_IRQn);
            }
        }

        // Flip to next buffer
        AutoAnalog::aCtr = (AutoAnalog::aCtr + 1) % 2;
    }
    else if (nrf_pdm_event_check(myPDM, NRF_PDM_EVENT_STOPPED)) {
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_STOPPED);
    }
    else if (nrf_pdm_event_check(myPDM, NRF_PDM_EVENT_END)) {
        nrf_pdm_event_clear(myPDM, NRF_PDM_EVENT_END);
    }
}
}

extern "C" {
__attribute__((__used__)) void PWM0_IRQHandler(void)
{

    // AutoAnalog::sampleCounter++;
}
}
    #endif // defined __MBED__

void AutoAnalog::set_callback(void (*function)(uint16_t* buf, uint32_t buf_len))
{
    _onReceive = function;
}

void AutoAnalog::adcCallback(uint16_t* buf, uint32_t buf_len)
{

    memcpy(adcBuffer16, buf, buf_len * 2);
    adcReady = true;
}

#endif //#if defined (ARDUINO_ARCH_SAM)